fio/fio_ceph_randwrite_write_only/map/disk_xfs/log_37/rbd0/fio_randwrite_24m.log
test: (g=0): rw=randwrite, bs=(R) 24.0MiB-24.0MiB, (W) 24.0MiB-24.0MiB, (T) 24.0MiB-24.0MiB, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=157536: Mon Aug  6 12:20:09 2018
  write: IOPS=10, BW=257MiB/s (270MB/s)(9.98GiB/39773msec)
    slat (usec): min=1666, max=254541, avg=76783.05, stdev=67114.90
    clat (msec): min=921, max=15440, avg=5792.91, stdev=2056.50
     lat (msec): min=923, max=15463, avg=5869.70, stdev=2067.76
    clat percentiles (msec):
     |  1.00th=[ 1854],  5.00th=[ 2903], 10.00th=[ 3406], 20.00th=[ 4245],
     | 30.00th=[ 4799], 40.00th=[ 5067], 50.00th=[ 5604], 60.00th=[ 6007],
     | 70.00th=[ 6477], 80.00th=[ 7148], 90.00th=[ 8490], 95.00th=[ 9463],
     | 99.00th=[12416], 99.50th=[12818], 99.90th=[15503], 99.95th=[15503],
     | 99.99th=[15503]
   bw (  KiB/s): min=49152, max=394004, per=98.25%, avg=258615.07, stdev=56350.75, samples=69
   iops        : min=    2, max=   16, avg=10.52, stdev= 2.29, samples=69
  lat (msec)   : 1000=0.23%, 2000=1.41%, >=2000=98.36%
  cpu          : usr=2.03%, sys=1.13%, ctx=381, majf=0, minf=27
  IO depths    : 1=0.2%, 2=0.5%, 4=0.9%, 8=1.9%, 16=3.8%, 32=7.5%, >=64=85.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.7%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.3%, >=64=0.0%
     issued rwt: total=0,426,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=257MiB/s (270MB/s), 257MiB/s-257MiB/s (270MB/s-270MB/s), io=9.98GiB (10.7GB), run=39773-39773msec

Disk stats (read/write):
  rbd0: ios=0/2643, merge=0/10213, ticks=0/8634123, in_queue=9212062, util=96.94%